#Поработайте с переменными, создайте несколько, выведите на экран.
#Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

number1=100
str1='А сколько вам нужно было переменных?'
bol1=True
print(f'Внутри я завела {number1}, {str1}, {bol1}')
print(f'...и типы у них {type(number1)}, {type(str1)}, {type(bol1)}')
print('🔻🔻🔻🔻 дальше ввод')
str2=input('С кем имею честь говорить: ')
str3=input('Сколько тебе лет: ')
str4=input('Что ты думаешь о моем коде: ')
print(f'Спасите пользователя {str2}, которому {str3} год(а) и он считает мой код {str4}')

## я просто шла с 6 задания на первое и уже хочу спать =))